# Pandas: Analysis and manipulation
1. info()
2. describe()
3. head()
4. tail()
5. column()
6. dtype
7. sort_values()
8. sort_index()
9. volue_count()
10. groupby()
11. pivert_table
12. cross_table
13. agg_function = sum, max, min, mean, etc

# Data Preprocessing (cleaning)
1. Fixing rows and columns = delete, add, rename, datatype
2. handling dublicates



-----------------
|emp|role|salary|
-----------------
||||


np.where(df['salary'] > 10000, 'A', 'B')

In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame({
    'Location':['A','B','C','D'],
    'Profit':['100 USD', '40 CAD', '200 CAD', '1000 INR'],
})

df

  Location    Profit
0        A   100 USD
1        B    40 CAD
2        C   200 CAD
3        D  1000 INR

In [4]:
df[['Amount','Currency']] = df['Profit'].str.split(' ', expand=True )

df

  Location    Profit Amount Currency
0        A   100 USD    100      USD
1        B    40 CAD     40      CAD
2        C   200 CAD    200      CAD
3        D  1000 INR   1000      INR

In [7]:
df['Currency Value'] = np.where(df['Currency']=='USD', 85, np.where(df['Currency']=='CAD', 45, 1))
df

  Location    Profit Amount Currency  Currency Value
0        A   100 USD    100      USD              85
1        B    40 CAD     40      CAD              45
2        C   200 CAD    200      CAD              45
3        D  1000 INR   1000      INR               1

In [10]:
df['Amount'] = df['Amount'].astype(int)

df.dtypes

Location          object
Profit            object
Amount             int64
Currency          object
Currency Value     int64
dtype: object

In [ ]:
df Profit

# Handling dublicates 
1. identify = dublicated().sum() = total number of dublicates
2. delete = drop_dublicates()

In [11]:
df = pd.DataFrame({
    'Location':['A','B','A','D'],
    'Profit':[100,200,100,400],
})

df

  Location  Profit
0        A     100
1        B     200
2        A     100
3        D     400

In [14]:
df.duplicated().sum()

np.int64(1)

In [15]:
df[df.duplicated()]

  Location  Profit
2        A     100

In [16]:
df.drop_duplicates(inplace=True)

In [17]:
df

  Location  Profit
0        A     100
1        B     200
3        D     400

# Handling missing values

Identify
1. fillin 
2. Dropping

Identify: isnull() or isna().sum()

Delete: drop_na()

filling: fillna() = mean, medium, mod, constent, etc

if data is normal = mean
if data is abnormal = medium (outlier = extreme high or extreame low)
if data is repetative = mod

In [35]:
df = pd.DataFrame({
    'Location':['A','B','A','D'],
    'Profit':[100,np.nan,np.nan,400],
    'Discount':[5,15,12,np.nan]
})

df

  Location  Profit  Discount
0        A   100.0       5.0
1        B     NaN      15.0
2        A     NaN      12.0
3        D   400.0       NaN

In [36]:
# identify

df.isnull().sum()

Location    0
Profit      2
Discount    1
dtype: int64

In [37]:
df['Profit'].isnull().sum()

np.int64(2)

In [38]:
#deleting bull values

df.dropna()

  Location  Profit  Discount
0        A   100.0       5.0

In [39]:
# calculate null values percentage
df.isnull().sum()/len(df)*100

Location     0.0
Profit      50.0
Discount    25.0
dtype: float64

In [40]:
df['Profit'].fillna(150)

0    100.0
1    150.0
2    150.0
3    400.0
Name: Profit, dtype: float64

In [42]:
df['Profit'].mean()

np.float64(250.0)

In [47]:
df['Profit'].median()

np.float64(250.0)

In [49]:
df['Profit'].fillna(250)

0    100.0
1    250.0
2    250.0
3    400.0
Name: Profit, dtype: float64

# imputation

interpolation -> filling by using prediction -> interpolate()

In [50]:
df.interpolate()

/tmp/ipykernel_3949/4002874584.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate()

  Location  Profit  Discount
0        A   100.0       5.0
1        B   200.0      15.0
2        A   300.0      12.0
3        D   400.0      12.0